
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Счета Приход
	Движения.Счета.Записывать = Истина;
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл
		Движение = Движения.Счета.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Брокер = Брокер;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Количество = ТекСтрокаИнструменты.Количество;
		//Движение.Цена = ТекСтрокаИнструменты.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
