
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Счета.Записывать = Истина;
	Для Каждого ТекСтрокаИнструменты Из Инструменты Цикл 
		
		
		если ТекСтрокаИнструменты.Вид=Перечисления.ВидОрдера.Sell тогда  
			Движение = Движения.Счета.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		иначеЕсли ТекСтрокаИнструменты.Вид=Перечисления.ВидОрдера.Bye тогда 
			Движение = Движения.Счета.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;  
			
		иначеЕсли ТекСтрокаИнструменты.Вид=Перечисления.ВидОрдера.Коммисия тогда 
           Продолжить;
			
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.Брокер = Брокер;
		Движение.Инструмент = ТекСтрокаИнструменты.Инструмент;
		Движение.Количество = ТекСтрокаИнструменты.Количество;
	КонецЦикла;
	
КонецПроцедуры
